Tekla.Structures.ModelInternal.BimModelDataProduct.AccessControlListEntry
Represents an entry in the access control list for a BIM model, associating a principal with an access level.
Note: Model ID and creation info have been removed from this DTO as they are not needed for the UI.

Tekla.Structures.ModelInternal.BimModelDataProduct.AccessControlListEntry.AllowedAccessLevels
The allowed access levels.

Tekla.Structures.ModelInternal.BimModelDataProduct.AccessControlListEntry.AccessLevel
The access level assigned to the principal.

Tekla.Structures.ModelInternal.BimModelDataProduct.AccessControlListEntry.ModelId
The model identifier to which this access control entry applies.

Tekla.Structures.ModelInternal.BimModelDataProduct.AccessControlListEntry.PrincipalId
The principal identifier in CURIE format.
Example: "user:example_user@email.com"

Tekla.Structures.ModelInternal.BimModelDataProduct.AccessControlListEntry.#ctor(System.String,System.String)
Initializes a new instance of the Tekla.Structures.ModelInternal.BimModelDataProduct.AccessControlListEntry class.
user: The user name in CURIE format. Example: "user:example_user@email.com"
accessLevel: The access level assigned to the user. Must be one of "admin", "read", "write", or "none".